#### Terraform Plan 📖
<!-- terraform-plan-comment -->
<details><summary>Show Plan</summary>

```terraform
Acquiring state lock. This may take a few moments...
google_monitoring_uptime_check_config.availability["crayfits"]: Refreshing state... [id=projects/libops-public-microservices/uptimeCheckConfigs/crayfits-availability-7_McV0cG3IU]
google_monitoring_uptime_check_config.availability["homarus"]: Refreshing state... [id=projects/libops-public-microservices/uptimeCheckConfigs/homarus-availability--pm76nfsbNM]
google_monitoring_uptime_check_config.availability["houdini"]: Refreshing state... [id=projects/libops-public-microservices/uptimeCheckConfigs/houdini-availability--pm76nfsbjw]
google_monitoring_uptime_check_config.availability["hypercube"]: Refreshing state... [id=projects/libops-public-microservices/uptimeCheckConfigs/hypercube-availability-uj2slOcnzdY]
google_monitoring_uptime_check_config.availability["libreoffice"]: Refreshing state... [id=projects/libops-public-microservices/uptimeCheckConfigs/libreoffice-availability-yR9xdWLgolc]
google_monitoring_uptime_check_config.availability["ocrpdf"]: Refreshing state... [id=projects/libops-public-microservices/uptimeCheckConfigs/ocrpdf-availability-sOY-TXhAvZA]
google_monitoring_uptime_check_config.availability["pandoc"]: Refreshing state... [id=projects/libops-public-microservices/uptimeCheckConfigs/pandoc-availability-y1tcIMTdvoQ]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # module.crayfits.google_cloud_run_service.cloudrun["australia-southeast1"] will be updated in-place
  ~ resource "google_cloud_run_service" "cloudrun" {
        id                         = "locations/australia-southeast1/namespaces/libops-public-microservices/services/crayfits"
        name                       = "crayfits"
        # (4 unchanged attributes hidden)

      ~ template {
          ~ spec {
                # (4 unchanged attributes hidden)

              ~ containers {
                  ~ image   = "lehighlts/scyllaridae-fits:main@sha256:ae5e323a22fddbdd3a0fcf0d4b849f5bb8d583920056aefa41a9de918c3ffc83" -> "ghcr.io/lehigh-university-libraries/scyllaridae-fits:main"
                    name    = "crayfits"
                    # (2 unchanged attributes hidden)

                    # (6 unchanged blocks hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.crayfits.google_cloud_run_service.cloudrun["australia-southeast2"] will be updated in-place
  ~ resource "google_cloud_run_service" "cloudrun" {
        id                         = "locations/australia-southeast2/namespaces/libops-public-microservices/services/crayfits"
        name                       = "crayfits"
        # (4 unchanged attributes hidden)

      ~ template {
          ~ spec {
                # (4 unchanged attributes hidden)

              ~ containers {
                  ~ image   = "lehighlts/scyllaridae-fits:main@sha256:ae5e323a22fddbdd3a0fcf0d4b849f5bb8d583920056aefa41a9de918c3ffc83" -> "ghcr.io/lehigh-university-libraries/scyllaridae-fits:main"
                    name    = "crayfits"
                    # (2 unchanged attributes hidden)

                    # (6 unchanged blocks hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.crayfits.google_cloud_run_service.cloudrun["northamerica-northeast1"] will be updated in-place
  ~ resource "google_cloud_run_service" "cloudrun" {
        id                         = "locations/northamerica-northeast1/namespaces/libops-public-microservices/services/crayfits"
        name                       = "crayfits"
        # (4 unchanged attributes hidden)

      ~ template {
          ~ spec {
                # (4 unchanged attributes hidden)

              ~ containers {
                  ~ image   = "lehighlts/scyllaridae-fits:main@sha256:ae5e323a22fddbdd3a0fcf0d4b849f5bb8d583920056aefa41a9de918c3ffc83" -> "ghcr.io/lehigh-university-libraries/scyllaridae-fits:main"
                    name    = "crayfits"
                    # (2 unchanged attributes hidden)

                    # (6 unchanged blocks hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.crayfits.google_cloud_run_service.cloudrun["northamerica-northeast2"] will be updated in-place
  ~ resource "google_cloud_run_service" "cloudrun" {
        id                         = "locations/northamerica-northeast2/namespaces/libops-public-microservices/services/crayfits"
        name                       = "crayfits"
        # (4 unchanged attributes hidden)

      ~ template {
          ~ spec {
                # (4 unchanged attributes hidden)

              ~ containers {
                  ~ image   = "lehighlts/scyllaridae-fits:main@sha256:ae5e323a22fddbdd3a0fcf0d4b849f5bb8d583920056aefa41a9de918c3ffc83" -> "ghcr.io/lehigh-university-libraries/scyllaridae-fits:main"
                    name    = "crayfits"
                    # (2 unchanged attributes hidden)

                    # (6 unchanged blocks hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.crayfits.google_cloud_run_service.cloudrun["us-central1"] will be updated in-place
  ~ resource "google_cloud_run_service" "cloudrun" {
        id                         = "locations/us-central1/namespaces/libops-public-microservices/services/crayfits"
        name                       = "crayfits"
        # (4 unchanged attributes hidden)

      ~ template {
          ~ spec {
                # (4 unchanged attributes hidden)

              ~ containers {
                  ~ image   = "lehighlts/scyllaridae-fits:main@sha256:ae5e323a22fddbdd3a0fcf0d4b849f5bb8d583920056aefa41a9de918c3ffc83" -> "ghcr.io/lehigh-university-libraries/scyllaridae-fits:main"
                    name    = "crayfits"
                    # (2 unchanged attributes hidden)

                    # (6 unchanged blocks hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.crayfits.google_cloud_run_service.cloudrun["us-east4"] will be updated in-place
  ~ resource "google_cloud_run_service" "cloudrun" {
        id                         = "locations/us-east4/namespaces/libops-public-microservices/services/crayfits"
        name                       = "crayfits"
        # (4 unchanged attributes hidden)

      ~ template {
          ~ spec {
                # (4 unchanged attributes hidden)

              ~ containers {
                  ~ image   = "lehighlts/scyllaridae-fits:main@sha256:ae5e323a22fddbdd3a0fcf0d4b849f5bb8d583920056aefa41a9de918c3ffc83" -> "ghcr.io/lehigh-university-libraries/scyllaridae-fits:main"
                    name    = "crayfits"
                    # (2 unchanged attributes hidden)

                    # (6 unchanged blocks hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.crayfits.google_cloud_run_service.cloudrun["us-east5"] will be updated in-place
  ~ resource "google_cloud_run_service" "cloudrun" {
        id                         = "locations/us-east5/namespaces/libops-public-microservices/services/crayfits"
        name                       = "crayfits"
        # (4 unchanged attributes hidden)

      ~ template {
          ~ spec {
                # (4 unchanged attributes hidden)

              ~ containers {
                  ~ image   = "lehighlts/scyllaridae-fits:main@sha256:ae5e323a22fddbdd3a0fcf0d4b849f5bb8d583920056aefa41a9de918c3ffc83" -> "ghcr.io/lehigh-university-libraries/scyllaridae-fits:main"
                    name    = "crayfits"
                    # (2 unchanged attributes hidden)

                    # (6 unchanged blocks hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.crayfits.google_cloud_run_service.cloudrun["us-south1"] will be updated in-place
  ~ resource "google_cloud_run_service" "cloudrun" {
        id                         = "locations/us-south1/namespaces/libops-public-microservices/services/crayfits"
        name                       = "crayfits"
        # (4 unchanged attributes hidden)

      ~ template {
          ~ spec {
                # (4 unchanged attributes hidden)

              ~ containers {
                  ~ image   = "lehighlts/scyllaridae-fits:main@sha256:ae5e323a22fddbdd3a0fcf0d4b849f5bb8d583920056aefa41a9de918c3ffc83" -> "ghcr.io/lehigh-university-libraries/scyllaridae-fits:main"
                    name    = "crayfits"
                    # (2 unchanged attributes hidden)

                    # (6 unchanged blocks hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.crayfits.google_cloud_run_service.cloudrun["us-west1"] will be updated in-place
  ~ resource "google_cloud_run_service" "cloudrun" {
        id                         = "locations/us-west1/namespaces/libops-public-microservices/services/crayfits"
        name                       = "crayfits"
        # (4 unchanged attributes hidden)

      ~ template {
          ~ spec {
                # (4 unchanged attributes hidden)

              ~ containers {
                  ~ image   = "lehighlts/scyllaridae-fits:main@sha256:ae5e323a22fddbdd3a0fcf0d4b849f5bb8d583920056aefa41a9de918c3ffc83" -> "ghcr.io/lehigh-university-libraries/scyllaridae-fits:main"
                    name    = "crayfits"
                    # (2 unchanged attributes hidden)

                    # (6 unchanged blocks hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.crayfits.google_cloud_run_service.cloudrun["us-west3"] will be updated in-place
  ~ resource "google_cloud_run_service" "cloudrun" {
        id                         = "locations/us-west3/namespaces/libops-public-microservices/services/crayfits"
        name                       = "crayfits"
        # (4 unchanged attributes hidden)

      ~ template {
          ~ spec {
                # (4 unchanged attributes hidden)

              ~ containers {
                  ~ image   = "lehighlts/scyllaridae-fits:main@sha256:ae5e323a22fddbdd3a0fcf0d4b849f5bb8d583920056aefa41a9de918c3ffc83" -> "ghcr.io/lehigh-university-libraries/scyllaridae-fits:main"
                    name    = "crayfits"
                    # (2 unchanged attributes hidden)

                    # (6 unchanged blocks hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.crayfits.google_cloud_run_service.cloudrun["us-west4"] will be updated in-place
  ~ resource "google_cloud_run_service" "cloudrun" {
        id                         = "locations/us-west4/namespaces/libops-public-microservices/services/crayfits"
        name                       = "crayfits"
        # (4 unchanged attributes hidden)

      ~ template {
          ~ spec {
                # (4 unchanged attributes hidden)

              ~ containers {
                  ~ image   = "lehighlts/scyllaridae-fits:main@sha256:ae5e323a22fddbdd3a0fcf0d4b849f5bb8d583920056aefa41a9de918c3ffc83" -> "ghcr.io/lehigh-university-libraries/scyllaridae-fits:main"
                    name    = "crayfits"
                    # (2 unchanged attributes hidden)

                    # (6 unchanged blocks hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.fits.google_cloud_run_service.cloudrun["australia-southeast1"] will be updated in-place
  ~ resource "google_cloud_run_service" "cloudrun" {
        id                         = "locations/australia-southeast1/namespaces/libops-public-microservices/services/fits"
        name                       = "fits"
        # (4 unchanged attributes hidden)

      ~ template {
          ~ spec {
                # (4 unchanged attributes hidden)

              ~ containers {
                  ~ image   = "islandora/fits:main@sha256:e824a107ce8d60e6d0458fe9a6541f670264e83a9669623a15d3252d6c8f516a" -> "islandora/fits:main@sha256:698971c83dfc7afd98926486700bb951498246503ca26bc8e7c3174d0e3df066"
                    name    = "fits"
                    # (2 unchanged attributes hidden)

                    # (4 unchanged blocks hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.fits.google_cloud_run_service.cloudrun["australia-southeast2"] will be updated in-place
  ~ resource "google_cloud_run_service" "cloudrun" {
        id                         = "locations/australia-southeast2/namespaces/libops-public-microservices/services/fits"
        name                       = "fits"
        # (4 unchanged attributes hidden)

      ~ template {
          ~ spec {
                # (4 unchanged attributes hidden)

              ~ containers {
                  ~ image   = "islandora/fits:main@sha256:e824a107ce8d60e6d0458fe9a6541f670264e83a9669623a15d3252d6c8f516a" -> "islandora/fits:main@sha256:698971c83dfc7afd98926486700bb951498246503ca26bc8e7c3174d0e3df066"
                    name    = "fits"
                    # (2 unchanged attributes hidden)

                    # (4 unchanged blocks hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.fits.google_cloud_run_service.cloudrun["northamerica-northeast1"] will be updated in-place
  ~ resource "google_cloud_run_service" "cloudrun" {
        id                         = "locations/northamerica-northeast1/namespaces/libops-public-microservices/services/fits"
        name                       = "fits"
        # (4 unchanged attributes hidden)

      ~ template {
          ~ spec {
                # (4 unchanged attributes hidden)

              ~ containers {
                  ~ image   = "islandora/fits:main@sha256:e824a107ce8d60e6d0458fe9a6541f670264e83a9669623a15d3252d6c8f516a" -> "islandora/fits:main@sha256:698971c83dfc7afd98926486700bb951498246503ca26bc8e7c3174d0e3df066"
                    name    = "fits"
                    # (2 unchanged attributes hidden)

                    # (4 unchanged blocks hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.fits.google_cloud_run_service.cloudrun["northamerica-northeast2"] will be updated in-place
  ~ resource "google_cloud_run_service" "cloudrun" {
        id                         = "locations/northamerica-northeast2/namespaces/libops-public-microservices/services/fits"
        name                       = "fits"
        # (4 unchanged attributes hidden)

      ~ template {
          ~ spec {
                # (4 unchanged attributes hidden)

              ~ containers {
                  ~ image   = "islandora/fits:main@sha256:e824a107ce8d60e6d0458fe9a6541f670264e83a9669623a15d3252d6c8f516a" -> "islandora/fits:main@sha256:698971c83dfc7afd98926486700bb951498246503ca26bc8e7c3174d0e3df066"
                    name    = "fits"
                    # (2 unchanged attributes hidden)

                    # (4 unchanged blocks hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.fits.google_cloud_run_service.cloudrun["us-central1"] will be updated in-place
  ~ resource "google_cloud_run_service" "cloudrun" {
        id                         = "locations/us-central1/namespaces/libops-public-microservices/services/fits"
        name                       = "fits"
        # (4 unchanged attributes hidden)

      ~ template {
          ~ spec {
                # (4 unchanged attributes hidden)

              ~ containers {
                  ~ image   = "islandora/fits:main@sha256:e824a107ce8d60e6d0458fe9a6541f670264e83a9669623a15d3252d6c8f516a" -> "islandora/fits:main@sha256:698971c83dfc7afd98926486700bb951498246503ca26bc8e7c3174d0e3df066"
                    name    = "fits"
                    # (2 unchanged attributes hidden)

                    # (4 unchanged blocks hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.fits.google_cloud_run_service.cloudrun["us-east4"] will be updated in-place
  ~ resource "google_cloud_run_service" "cloudrun" {
        id                         = "locations/us-east4/namespaces/libops-public-microservices/services/fits"
        name                       = "fits"
        # (4 unchanged attributes hidden)

      ~ template {
          ~ spec {
                # (4 unchanged attributes hidden)

              ~ containers {
                  ~ image   = "islandora/fits:main@sha256:e824a107ce8d60e6d0458fe9a6541f670264e83a9669623a15d3252d6c8f516a" -> "islandora/fits:main@sha256:698971c83dfc7afd98926486700bb951498246503ca26bc8e7c3174d0e3df066"
                    name    = "fits"
                    # (2 unchanged attributes hidden)

                    # (4 unchanged blocks hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.fits.google_cloud_run_service.cloudrun["us-east5"] will be updated in-place
  ~ resource "google_cloud_run_service" "cloudrun" {
        id                         = "locations/us-east5/namespaces/libops-public-microservices/services/fits"
        name                       = "fits"
        # (4 unchanged attributes hidden)

      ~ template {
          ~ spec {
                # (4 unchanged attributes hidden)

              ~ containers {
                  ~ image   = "islandora/fits:main@sha256:e824a107ce8d60e6d0458fe9a6541f670264e83a9669623a15d3252d6c8f516a" -> "islandora/fits:main@sha256:698971c83dfc7afd98926486700bb951498246503ca26bc8e7c3174d0e3df066"
                    name    = "fits"
                    # (2 unchanged attributes hidden)

                    # (4 unchanged blocks hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.fits.google_cloud_run_service.cloudrun["us-south1"] will be updated in-place
  ~ resource "google_cloud_run_service" "cloudrun" {
        id                         = "locations/us-south1/namespaces/libops-public-microservices/services/fits"
        name                       = "fits"
        # (4 unchanged attributes hidden)

      ~ template {
          ~ spec {
                # (4 unchanged attributes hidden)

              ~ containers {
                  ~ image   = "islandora/fits:main@sha256:e824a107ce8d60e6d0458fe9a6541f670264e83a9669623a15d3252d6c8f516a" -> "islandora/fits:main@sha256:698971c83dfc7afd98926486700bb951498246503ca26bc8e7c3174d0e3df066"
                    name    = "fits"
                    # (2 unchanged attributes hidden)

                    # (4 unchanged blocks hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.fits.google_cloud_run_service.cloudrun["us-west1"] will be updated in-place
  ~ resource "google_cloud_run_service" "cloudrun" {
        id                         = "locations/us-west1/namespaces/libops-public-microservices/services/fits"
        name                       = "fits"
        # (4 unchanged attributes hidden)

      ~ template {
          ~ spec {
                # (4 unchanged attributes hidden)

              ~ containers {
                  ~ image   = "islandora/fits:main@sha256:e824a107ce8d60e6d0458fe9a6541f670264e83a9669623a15d3252d6c8f516a" -> "islandora/fits:main@sha256:698971c83dfc7afd98926486700bb951498246503ca26bc8e7c3174d0e3df066"
                    name    = "fits"
                    # (2 unchanged attributes hidden)

                    # (4 unchanged blocks hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.fits.google_cloud_run_service.cloudrun["us-west3"] will be updated in-place
  ~ resource "google_cloud_run_service" "cloudrun" {
        id                         = "locations/us-west3/namespaces/libops-public-microservices/services/fits"
        name                       = "fits"
        # (4 unchanged attributes hidden)

      ~ template {
          ~ spec {
                # (4 unchanged attributes hidden)

              ~ containers {
                  ~ image   = "islandora/fits:main@sha256:e824a107ce8d60e6d0458fe9a6541f670264e83a9669623a15d3252d6c8f516a" -> "islandora/fits:main@sha256:698971c83dfc7afd98926486700bb951498246503ca26bc8e7c3174d0e3df066"
                    name    = "fits"
                    # (2 unchanged attributes hidden)

                    # (4 unchanged blocks hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.fits.google_cloud_run_service.cloudrun["us-west4"] will be updated in-place
  ~ resource "google_cloud_run_service" "cloudrun" {
        id                         = "locations/us-west4/namespaces/libops-public-microservices/services/fits"
        name                       = "fits"
        # (4 unchanged attributes hidden)

      ~ template {
          ~ spec {
                # (4 unchanged attributes hidden)

              ~ containers {
                  ~ image   = "islandora/fits:main@sha256:e824a107ce8d60e6d0458fe9a6541f670264e83a9669623a15d3252d6c8f516a" -> "islandora/fits:main@sha256:698971c83dfc7afd98926486700bb951498246503ca26bc8e7c3174d0e3df066"
                    name    = "fits"
                    # (2 unchanged attributes hidden)

                    # (4 unchanged blocks hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.gpt-oss-20b.google_cloud_run_v2_service.cloudrun["us-central1"] will be created
  + resource "google_cloud_run_v2_service" "cloudrun" {
      + conditions              = (known after apply)
      + create_time             = (known after apply)
      + creator                 = (known after apply)
      + delete_time             = (known after apply)
      + deletion_protection     = true
      + effective_annotations   = (known after apply)
      + effective_labels        = {
          + "goog-terraform-provisioned" = "true"
        }
      + etag                    = (known after apply)
      + expire_time             = (known after apply)
      + generation              = (known after apply)
      + id                      = (known after apply)
      + ingress                 = (known after apply)
      + last_modifier           = (known after apply)
      + latest_created_revision = (known after apply)
      + latest_ready_revision   = (known after apply)
      + launch_stage            = "BETA"
      + location                = "us-central1"
      + name                    = "gpt-20b"
      + observed_generation     = (known after apply)
      + project                 = "libops-public-microservices"
      + reconciling             = (known after apply)
      + terminal_condition      = (known after apply)
      + terraform_labels        = {
          + "goog-terraform-provisioned" = "true"
        }
      + traffic_statuses        = (known after apply)
      + uid                     = (known after apply)
      + update_time             = (known after apply)
      + uri                     = (known after apply)
      + urls                    = (known after apply)

      + template {
          + execution_environment            = "EXECUTION_ENVIRONMENT_GEN2"
          + gpu_zonal_redundancy_disabled    = true
          + max_instance_request_concurrency = (known after apply)
          + service_account                  = "cr-microservices@libops-public-microservices.iam.gserviceaccount.com"
          + timeout                          = (known after apply)

          + containers {
              + build_info = (known after apply)
              + image      = "us-docker.pkg.dev/libops-public-microservices/shared/gpt-20b:main"
              + name       = "openai"

              + env {
                  + name  = "SKIP_JWT_VERIFY"
                  + value = "true"
                }

              + ports {
                  + container_port = 8080
                  + name           = (known after apply)
                }

              + resources {
                  + cpu_idle = false
                  + limits   = {
                      + "cpu"            = "8000m"
                      + "memory"         = "32Gi"
                      + "nvidia.com/gpu" = "1"
                    }
                }
            }

          + scaling {
              + max_instance_count = 1
              + min_instance_count = 0
            }
        }
    }

  # module.gpt-oss-20b.google_cloud_run_v2_service_iam_member.invoker["us-central1"] will be created
  + resource "google_cloud_run_v2_service_iam_member" "invoker" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + location = "us-central1"
      + member   = "allUsers"
      + name     = "gpt-20b"
      + project  = "libops-public-microservices"
      + role     = "roles/run.invoker"
    }

  # module.gpt-oss-20b.google_compute_backend_service.backend[0] will be created
  + resource "google_compute_backend_service" "backend" {
      + connection_draining_timeout_sec = 300
      + creation_timestamp              = (known after apply)
      + fingerprint                     = (known after apply)
      + generated_id                    = (known after apply)
      + id                              = (known after apply)
      + load_balancing_scheme           = "EXTERNAL_MANAGED"
      + name                            = "libops-backend-gpt-20b"
      + port_name                       = (known after apply)
      + project                         = "libops-public-microservices"
      + protocol                        = "HTTPS"
      + self_link                       = (known after apply)
      + session_affinity                = (known after apply)
      + timeout_sec                     = (known after apply)

      + backend {
          + balancing_mode               = "UTILIZATION"
          + capacity_scaler              = 1
          + group                        = (known after apply)
          + max_connections              = (known after apply)
          + max_connections_per_endpoint = (known after apply)
          + max_connections_per_instance = (known after apply)
          + max_rate                     = (known after apply)
          + max_rate_per_endpoint        = (known after apply)
          + max_rate_per_instance        = (known after apply)
          + max_utilization              = (known after apply)
        }

      + log_config {
          + enable        = true
          + optional_mode = (known after apply)
          + sample_rate   = 1
        }
    }

  # module.gpt-oss-20b.google_compute_region_network_endpoint_group.neg["us-central1"] will be created
  + resource "google_compute_region_network_endpoint_group" "neg" {
      + id                    = (known after apply)
      + name                  = "libops-neg-gpt-20b-us-central1"
      + network_endpoint_type = "SERVERLESS"
      + project               = "libops-public-microservices"
      + region                = "us-central1"
      + self_link             = (known after apply)

      + cloud_run {
          + service = "gpt-20b"
        }
    }

  # module.homarus.google_cloud_run_service.cloudrun["australia-southeast1"] will be updated in-place
  ~ resource "google_cloud_run_service" "cloudrun" {
        id                         = "locations/australia-southeast1/namespaces/libops-public-microservices/services/homarus"
        name                       = "homarus"
        # (4 unchanged attributes hidden)

      ~ template {
          ~ spec {
                # (4 unchanged attributes hidden)

              ~ containers {
                  ~ image   = "lehighlts/scyllaridae-ffmpeg:main@sha256:b8f789f3ad8e64fb3bb202b18384e122da79b28a58abc552aa25748cc2d4996b" -> "ghcr.io/lehigh-university-libraries/scyllaridae-ffmpeg:main"
                    name    = "homarus"
                    # (2 unchanged attributes hidden)

                    # (5 unchanged blocks hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.homarus.google_cloud_run_service.cloudrun["australia-southeast2"] will be updated in-place
  ~ resource "google_cloud_run_service" "cloudrun" {
        id                         = "locations/australia-southeast2/namespaces/libops-public-microservices/services/homarus"
        name                       = "homarus"
        # (4 unchanged attributes hidden)

      ~ template {
          ~ spec {
                # (4 unchanged attributes hidden)

              ~ containers {
                  ~ image   = "lehighlts/scyllaridae-ffmpeg:main@sha256:b8f789f3ad8e64fb3bb202b18384e122da79b28a58abc552aa25748cc2d4996b" -> "ghcr.io/lehigh-university-libraries/scyllaridae-ffmpeg:main"
                    name    = "homarus"
                    # (2 unchanged attributes hidden)

                    # (5 unchanged blocks hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.homarus.google_cloud_run_service.cloudrun["northamerica-northeast1"] will be updated in-place
  ~ resource "google_cloud_run_service" "cloudrun" {
        id                         = "locations/northamerica-northeast1/namespaces/libops-public-microservices/services/homarus"
        name                       = "homarus"
        # (4 unchanged attributes hidden)

      ~ template {
          ~ spec {
                # (4 unchanged attributes hidden)

              ~ containers {
                  ~ image   = "lehighlts/scyllaridae-ffmpeg:main@sha256:b8f789f3ad8e64fb3bb202b18384e122da79b28a58abc552aa25748cc2d4996b" -> "ghcr.io/lehigh-university-libraries/scyllaridae-ffmpeg:main"
                    name    = "homarus"
                    # (2 unchanged attributes hidden)

                    # (5 unchanged blocks hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.homarus.google_cloud_run_service.cloudrun["northamerica-northeast2"] will be updated in-place
  ~ resource "google_cloud_run_service" "cloudrun" {
        id                         = "locations/northamerica-northeast2/namespaces/libops-public-microservices/services/homarus"
        name                       = "homarus"
        # (4 unchanged attributes hidden)

      ~ template {
          ~ spec {
                # (4 unchanged attributes hidden)

              ~ containers {
                  ~ image   = "lehighlts/scyllaridae-ffmpeg:main@sha256:b8f789f3ad8e64fb3bb202b18384e122da79b28a58abc552aa25748cc2d4996b" -> "ghcr.io/lehigh-university-libraries/scyllaridae-ffmpeg:main"
                    name    = "homarus"
                    # (2 unchanged attributes hidden)

                    # (5 unchanged blocks hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.homarus.google_cloud_run_service.cloudrun["us-central1"] will be updated in-place
  ~ resource "google_cloud_run_service" "cloudrun" {
        id                         = "locations/us-central1/namespaces/libops-public-microservices/services/homarus"
        name                       = "homarus"
        # (4 unchanged attributes hidden)

      ~ template {
          ~ spec {
                # (4 unchanged attributes hidden)

              ~ containers {
                  ~ image   = "lehighlts/scyllaridae-ffmpeg:main@sha256:b8f789f3ad8e64fb3bb202b18384e122da79b28a58abc552aa25748cc2d4996b" -> "ghcr.io/lehigh-university-libraries/scyllaridae-ffmpeg:main"
                    name    = "homarus"
                    # (2 unchanged attributes hidden)

                    # (5 unchanged blocks hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.homarus.google_cloud_run_service.cloudrun["us-east4"] will be updated in-place
  ~ resource "google_cloud_run_service" "cloudrun" {
        id                         = "locations/us-east4/namespaces/libops-public-microservices/services/homarus"
        name                       = "homarus"
        # (4 unchanged attributes hidden)

      ~ template {
          ~ spec {
                # (4 unchanged attributes hidden)

              ~ containers {
                  ~ image   = "lehighlts/scyllaridae-ffmpeg:main@sha256:b8f789f3ad8e64fb3bb202b18384e122da79b28a58abc552aa25748cc2d4996b" -> "ghcr.io/lehigh-university-libraries/scyllaridae-ffmpeg:main"
                    name    = "homarus"
                    # (2 unchanged attributes hidden)

                    # (5 unchanged blocks hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.homarus.google_cloud_run_service.cloudrun["us-east5"] will be updated in-place
  ~ resource "google_cloud_run_service" "cloudrun" {
        id                         = "locations/us-east5/namespaces/libops-public-microservices/services/homarus"
        name                       = "homarus"
        # (4 unchanged attributes hidden)

      ~ template {
          ~ spec {
                # (4 unchanged attributes hidden)

              ~ containers {
                  ~ image   = "lehighlts/scyllaridae-ffmpeg:main@sha256:b8f789f3ad8e64fb3bb202b18384e122da79b28a58abc552aa25748cc2d4996b" -> "ghcr.io/lehigh-university-libraries/scyllaridae-ffmpeg:main"
                    name    = "homarus"
                    # (2 unchanged attributes hidden)

                    # (5 unchanged blocks hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.homarus.google_cloud_run_service.cloudrun["us-south1"] will be updated in-place
  ~ resource "google_cloud_run_service" "cloudrun" {
        id                         = "locations/us-south1/namespaces/libops-public-microservices/services/homarus"
        name                       = "homarus"
        # (4 unchanged attributes hidden)

      ~ template {
          ~ spec {
                # (4 unchanged attributes hidden)

              ~ containers {
                  ~ image   = "lehighlts/scyllaridae-ffmpeg:main@sha256:b8f789f3ad8e64fb3bb202b18384e122da79b28a58abc552aa25748cc2d4996b" -> "ghcr.io/lehigh-university-libraries/scyllaridae-ffmpeg:main"
                    name    = "homarus"
                    # (2 unchanged attributes hidden)

                    # (5 unchanged blocks hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.homarus.google_cloud_run_service.cloudrun["us-west1"] will be updated in-place
  ~ resource "google_cloud_run_service" "cloudrun" {
        id                         = "locations/us-west1/namespaces/libops-public-microservices/services/homarus"
        name                       = "homarus"
        # (4 unchanged attributes hidden)

      ~ template {
          ~ spec {
                # (4 unchanged attributes hidden)

              ~ containers {
                  ~ image   = "lehighlts/scyllaridae-ffmpeg:main@sha256:b8f789f3ad8e64fb3bb202b18384e122da79b28a58abc552aa25748cc2d4996b" -> "ghcr.io/lehigh-university-libraries/scyllaridae-ffmpeg:main"
                    name    = "homarus"
                    # (2 unchanged attributes hidden)

                    # (5 unchanged blocks hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.homarus.google_cloud_run_service.cloudrun["us-west3"] will be updated in-place
  ~ resource "google_cloud_run_service" "cloudrun" {
        id                         = "locations/us-west3/namespaces/libops-public-microservices/services/homarus"
        name                       = "homarus"
        # (4 unchanged attributes hidden)

      ~ template {
          ~ spec {
                # (4 unchanged attributes hidden)

              ~ containers {
                  ~ image   = "lehighlts/scyllaridae-ffmpeg:main@sha256:b8f789f3ad8e64fb3bb202b18384e122da79b28a58abc552aa25748cc2d4996b" -> "ghcr.io/lehigh-university-libraries/scyllaridae-ffmpeg:main"
                    name    = "homarus"
                    # (2 unchanged attributes hidden)

                    # (5 unchanged blocks hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.homarus.google_cloud_run_service.cloudrun["us-west4"] will be updated in-place
  ~ resource "google_cloud_run_service" "cloudrun" {
        id                         = "locations/us-west4/namespaces/libops-public-microservices/services/homarus"
        name                       = "homarus"
        # (4 unchanged attributes hidden)

      ~ template {
          ~ spec {
                # (4 unchanged attributes hidden)

              ~ containers {
                  ~ image   = "lehighlts/scyllaridae-ffmpeg:main@sha256:b8f789f3ad8e64fb3bb202b18384e122da79b28a58abc552aa25748cc2d4996b" -> "ghcr.io/lehigh-university-libraries/scyllaridae-ffmpeg:main"
                    name    = "homarus"
                    # (2 unchanged attributes hidden)

                    # (5 unchanged blocks hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.houdini.google_cloud_run_service.cloudrun["australia-southeast1"] will be updated in-place
  ~ resource "google_cloud_run_service" "cloudrun" {
        id                         = "locations/australia-southeast1/namespaces/libops-public-microservices/services/houdini"
        name                       = "houdini"
        # (4 unchanged attributes hidden)

      ~ template {
          ~ spec {
                # (4 unchanged attributes hidden)

              ~ containers {
                  ~ image   = "lehighlts/scyllaridae-imagemagick:main@sha256:25e47a39f11dd6e039d474aad69ea18e5fea74636c6f65c1c3bd22fc9949cb77" -> "ghcr.io/lehigh-university-libraries/scyllaridae-imagemagick:main"
                    name    = "houdini"
                    # (2 unchanged attributes hidden)

                    # (5 unchanged blocks hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.houdini.google_cloud_run_service.cloudrun["australia-southeast2"] will be updated in-place
  ~ resource "google_cloud_run_service" "cloudrun" {
        id                         = "locations/australia-southeast2/namespaces/libops-public-microservices/services/houdini"
        name                       = "houdini"
        # (4 unchanged attributes hidden)

      ~ template {
          ~ spec {
                # (4 unchanged attributes hidden)

              ~ containers {
                  ~ image   = "lehighlts/scyllaridae-imagemagick:main@sha256:25e47a39f11dd6e039d474aad69ea18e5fea74636c6f65c1c3bd22fc9949cb77" -> "ghcr.io/lehigh-university-libraries/scyllaridae-imagemagick:main"
                    name    = "houdini"
                    # (2 unchanged attributes hidden)

                    # (5 unchanged blocks hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.houdini.google_cloud_run_service.cloudrun["northamerica-northeast1"] will be updated in-place
  ~ resource "google_cloud_run_service" "cloudrun" {
        id                         = "locations/northamerica-northeast1/namespaces/libops-public-microservices/services/houdini"
        name                       = "houdini"
        # (4 unchanged attributes hidden)

      ~ template {
          ~ spec {
                # (4 unchanged attributes hidden)

              ~ containers {
                  ~ image   = "lehighlts/scyllaridae-imagemagick:main@sha256:25e47a39f11dd6e039d474aad69ea18e5fea74636c6f65c1c3bd22fc9949cb77" -> "ghcr.io/lehigh-university-libraries/scyllaridae-imagemagick:main"
                    name    = "houdini"
                    # (2 unchanged attributes hidden)

                    # (5 unchanged blocks hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.houdini.google_cloud_run_service.cloudrun["northamerica-northeast2"] will be updated in-place
  ~ resource "google_cloud_run_service" "cloudrun" {
        id                         = "locations/northamerica-northeast2/namespaces/libops-public-microservices/services/houdini"
        name                       = "houdini"
        # (4 unchanged attributes hidden)

      ~ template {
          ~ spec {
                # (4 unchanged attributes hidden)

              ~ containers {
                  ~ image   = "lehighlts/scyllaridae-imagemagick:main@sha256:25e47a39f11dd6e039d474aad69ea18e5fea74636c6f65c1c3bd22fc9949cb77" -> "ghcr.io/lehigh-university-libraries/scyllaridae-imagemagick:main"
                    name    = "houdini"
                    # (2 unchanged attributes hidden)

                    # (5 unchanged blocks hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.houdini.google_cloud_run_service.cloudrun["us-central1"] will be updated in-place
  ~ resource "google_cloud_run_service" "cloudrun" {
        id                         = "locations/us-central1/namespaces/libops-public-microservices/services/houdini"
        name                       = "houdini"
        # (4 unchanged attributes hidden)

      ~ template {
          ~ spec {
                # (4 unchanged attributes hidden)

              ~ containers {
                  ~ image   = "lehighlts/scyllaridae-imagemagick:main@sha256:25e47a39f11dd6e039d474aad69ea18e5fea74636c6f65c1c3bd22fc9949cb77" -> "ghcr.io/lehigh-university-libraries/scyllaridae-imagemagick:main"
                    name    = "houdini"
                    # (2 unchanged attributes hidden)

                    # (5 unchanged blocks hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.houdini.google_cloud_run_service.cloudrun["us-east4"] will be updated in-place
  ~ resource "google_cloud_run_service" "cloudrun" {
        id                         = "locations/us-east4/namespaces/libops-public-microservices/services/houdini"
        name                       = "houdini"
        # (4 unchanged attributes hidden)

      ~ template {
          ~ spec {
                # (4 unchanged attributes hidden)

              ~ containers {
                  ~ image   = "lehighlts/scyllaridae-imagemagick:main@sha256:25e47a39f11dd6e039d474aad69ea18e5fea74636c6f65c1c3bd22fc9949cb77" -> "ghcr.io/lehigh-university-libraries/scyllaridae-imagemagick:main"
                    name    = "houdini"
                    # (2 unchanged attributes hidden)

                    # (5 unchanged blocks hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.houdini.google_cloud_run_service.cloudrun["us-east5"] will be updated in-place
  ~ resource "google_cloud_run_service" "cloudrun" {
        id                         = "locations/us-east5/namespaces/libops-public-microservices/services/houdini"
        name                       = "houdini"
        # (4 unchanged attributes hidden)

      ~ template {
          ~ spec {
                # (4 unchanged attributes hidden)

              ~ containers {
                  ~ image   = "lehighlts/scyllaridae-imagemagick:main@sha256:25e47a39f11dd6e039d474aad69ea18e5fea74636c6f65c1c3bd22fc9949cb77" -> "ghcr.io/lehigh-university-libraries/scyllaridae-imagemagick:main"
                    name    = "houdini"
                    # (2 unchanged attributes hidden)

                    # (5 unchanged blocks hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.houdini.google_cloud_run_service.cloudrun["us-south1"] will be updated in-place
  ~ resource "google_cloud_run_service" "cloudrun" {
        id                         = "locations/us-south1/namespaces/libops-public-microservices/services/houdini"
        name                       = "houdini"
        # (4 unchanged attributes hidden)

      ~ template {
          ~ spec {
                # (4 unchanged attributes hidden)

              ~ containers {
                  ~ image   = "lehighlts/scyllaridae-imagemagick:main@sha256:25e47a39f11dd6e039d474aad69ea18e5fea74636c6f65c1c3bd22fc9949cb77" -> "ghcr.io/lehigh-university-libraries/scyllaridae-imagemagick:main"
                    name    = "houdini"
                    # (2 unchanged attributes hidden)

                    # (5 unchanged blocks hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.houdini.google_cloud_run_service.cloudrun["us-west1"] will be updated in-place
  ~ resource "google_cloud_run_service" "cloudrun" {
        id                         = "locations/us-west1/namespaces/libops-public-microservices/services/houdini"
        name                       = "houdini"
        # (4 unchanged attributes hidden)

      ~ template {
          ~ spec {
                # (4 unchanged attributes hidden)

              ~ containers {
                  ~ image   = "lehighlts/scyllaridae-imagemagick:main@sha256:25e47a39f11dd6e039d474aad69ea18e5fea74636c6f65c1c3bd22fc9949cb77" -> "ghcr.io/lehigh-university-libraries/scyllaridae-imagemagick:main"
                    name    = "houdini"
                    # (2 unchanged attributes hidden)

                    # (5 unchanged blocks hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.houdini.google_cloud_run_service.cloudrun["us-west3"] will be updated in-place
  ~ resource "google_cloud_run_service" "cloudrun" {
        id                         = "locations/us-west3/namespaces/libops-public-microservices/services/houdini"
        name                       = "houdini"
        # (4 unchanged attributes hidden)

      ~ template {
          ~ spec {
                # (4 unchanged attributes hidden)

              ~ containers {
                  ~ image   = "lehighlts/scyllaridae-imagemagick:main@sha256:25e47a39f11dd6e039d474aad69ea18e5fea74636c6f65c1c3bd22fc9949cb77" -> "ghcr.io/lehigh-university-libraries/scyllaridae-imagemagick:main"
                    name    = "houdini"
                    # (2 unchanged attributes hidden)

                    # (5 unchanged blocks hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.houdini.google_cloud_run_service.cloudrun["us-west4"] will be updated in-place
  ~ resource "google_cloud_run_service" "cloudrun" {
        id                         = "locations/us-west4/namespaces/libops-public-microservices/services/houdini"
        name                       = "houdini"
        # (4 unchanged attributes hidden)

      ~ template {
          ~ spec {
                # (4 unchanged attributes hidden)

              ~ containers {
                  ~ image   = "lehighlts/scyllaridae-imagemagick:main@sha256:25e47a39f11dd6e039d474aad69ea18e5fea74636c6f65c1c3bd22fc9949cb77" -> "ghcr.io/lehigh-university-libraries/scyllaridae-imagemagick:main"
                    name    = "houdini"
                    # (2 unchanged attributes hidden)

                    # (5 unchanged blocks hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.hypercube.google_cloud_run_service.cloudrun["australia-southeast1"] will be updated in-place
  ~ resource "google_cloud_run_service" "cloudrun" {
        id                         = "locations/australia-southeast1/namespaces/libops-public-microservices/services/hypercube"
        name                       = "hypercube"
        # (4 unchanged attributes hidden)

      ~ template {
          ~ spec {
                # (4 unchanged attributes hidden)

              ~ containers {
                  ~ image   = "lehighlts/scyllaridae-tesseract:main@sha256:f978ec9271bdf3c76739ae4084700a10fb092eb10765151bafae3fc8a1d5a2a3" -> "ghcr.io/lehigh-university-libraries/scyllaridae-tesseract:main"
                    name    = "hypercube"
                    # (2 unchanged attributes hidden)

                    # (5 unchanged blocks hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.hypercube.google_cloud_run_service.cloudrun["australia-southeast2"] will be updated in-place
  ~ resource "google_cloud_run_service" "cloudrun" {
        id                         = "locations/australia-southeast2/namespaces/libops-public-microservices/services/hypercube"
        name                       = "hypercube"
        # (4 unchanged attributes hidden)

      ~ template {
          ~ spec {
                # (4 unchanged attributes hidden)

              ~ containers {
                  ~ image   = "lehighlts/scyllaridae-tesseract:main@sha256:f978ec9271bdf3c76739ae4084700a10fb092eb10765151bafae3fc8a1d5a2a3" -> "ghcr.io/lehigh-university-libraries/scyllaridae-tesseract:main"
                    name    = "hypercube"
                    # (2 unchanged attributes hidden)

                    # (5 unchanged blocks hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.hypercube.google_cloud_run_service.cloudrun["northamerica-northeast1"] will be updated in-place
  ~ resource "google_cloud_run_service" "cloudrun" {
        id                         = "locations/northamerica-northeast1/namespaces/libops-public-microservices/services/hypercube"
        name                       = "hypercube"
        # (4 unchanged attributes hidden)

      ~ template {
          ~ spec {
                # (4 unchanged attributes hidden)

              ~ containers {
                  ~ image   = "lehighlts/scyllaridae-tesseract:main@sha256:f978ec9271bdf3c76739ae4084700a10fb092eb10765151bafae3fc8a1d5a2a3" -> "ghcr.io/lehigh-university-libraries/scyllaridae-tesseract:main"
                    name    = "hypercube"
                    # (2 unchanged attributes hidden)

                    # (5 unchanged blocks hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.hypercube.google_cloud_run_service.cloudrun["northamerica-northeast2"] will be updated in-place
  ~ resource "google_cloud_run_service" "cloudrun" {
        id                         = "locations/northamerica-northeast2/namespaces/libops-public-microservices/services/hypercube"
        name                       = "hypercube"
        # (4 unchanged attributes hidden)

      ~ template {
          ~ spec {
                # (4 unchanged attributes hidden)

              ~ containers {
                  ~ image   = "lehighlts/scyllaridae-tesseract:main@sha256:f978ec9271bdf3c76739ae4084700a10fb092eb10765151bafae3fc8a1d5a2a3" -> "ghcr.io/lehigh-university-libraries/scyllaridae-tesseract:main"
                    name    = "hypercube"
                    # (2 unchanged attributes hidden)

                    # (5 unchanged blocks hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.hypercube.google_cloud_run_service.cloudrun["us-central1"] will be updated in-place
  ~ resource "google_cloud_run_service" "cloudrun" {
        id                         = "locations/us-central1/namespaces/libops-public-microservices/services/hypercube"
        name                       = "hypercube"
        # (4 unchanged attributes hidden)

      ~ template {
          ~ spec {
                # (4 unchanged attributes hidden)

              ~ containers {
                  ~ image   = "lehighlts/scyllaridae-tesseract:main@sha256:f978ec9271bdf3c76739ae4084700a10fb092eb10765151bafae3fc8a1d5a2a3" -> "ghcr.io/lehigh-university-libraries/scyllaridae-tesseract:main"
                    name    = "hypercube"
                    # (2 unchanged attributes hidden)

                    # (5 unchanged blocks hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.hypercube.google_cloud_run_service.cloudrun["us-east4"] will be updated in-place
  ~ resource "google_cloud_run_service" "cloudrun" {
        id                         = "locations/us-east4/namespaces/libops-public-microservices/services/hypercube"
        name                       = "hypercube"
        # (4 unchanged attributes hidden)

      ~ template {
          ~ spec {
                # (4 unchanged attributes hidden)

              ~ containers {
                  ~ image   = "lehighlts/scyllaridae-tesseract:main@sha256:f978ec9271bdf3c76739ae4084700a10fb092eb10765151bafae3fc8a1d5a2a3" -> "ghcr.io/lehigh-university-libraries/scyllaridae-tesseract:main"
                    name    = "hypercube"
                    # (2 unchanged attributes hidden)

                    # (5 unchanged blocks hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.hypercube.google_cloud_run_service.cloudrun["us-east5"] will be updated in-place
  ~ resource "google_cloud_run_service" "cloudrun" {
        id                         = "locations/us-east5/namespaces/libops-public-microservices/services/hypercube"
        name                       = "hypercube"
        # (4 unchanged attributes hidden)

      ~ template {
          ~ spec {
                # (4 unchanged attributes hidden)

              ~ containers {
                  ~ image   = "lehighlts/scyllaridae-tesseract:main@sha256:f978ec9271bdf3c76739ae4084700a10fb092eb10765151bafae3fc8a1d5a2a3" -> "ghcr.io/lehigh-university-libraries/scyllaridae-tesseract:main"
                    name    = "hypercube"
                    # (2 unchanged attributes hidden)

                    # (5 unchanged blocks hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.hypercube.google_cloud_run_service.cloudrun["us-south1"] will be updated in-place
  ~ resource "google_cloud_run_service" "cloudrun" {
        id                         = "locations/us-south1/namespaces/libops-public-microservices/services/hypercube"
        name                       = "hypercube"
        # (4 unchanged attributes hidden)

      ~ template {
          ~ spec {
                # (4 unchanged attributes hidden)

              ~ containers {
                  ~ image   = "lehighlts/scyllaridae-tesseract:main@sha256:f978ec9271bdf3c76739ae4084700a10fb092eb10765151bafae3fc8a1d5a2a3" -> "ghcr.io/lehigh-university-libraries/scyllaridae-tesseract:main"
                    name    = "hypercube"
                    # (2 unchanged attributes hidden)

                    # (5 unchanged blocks hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.hypercube.google_cloud_run_service.cloudrun["us-west1"] will be updated in-place
  ~ resource "google_cloud_run_service" "cloudrun" {
        id                         = "locations/us-west1/namespaces/libops-public-microservices/services/hypercube"
        name                       = "hypercube"
        # (4 unchanged attributes hidden)

      ~ template {
          ~ spec {
                # (4 unchanged attributes hidden)

              ~ containers {
                  ~ image   = "lehighlts/scyllaridae-tesseract:main@sha256:f978ec9271bdf3c76739ae4084700a10fb092eb10765151bafae3fc8a1d5a2a3" -> "ghcr.io/lehigh-university-libraries/scyllaridae-tesseract:main"
                    name    = "hypercube"
                    # (2 unchanged attributes hidden)

                    # (5 unchanged blocks hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.hypercube.google_cloud_run_service.cloudrun["us-west3"] will be updated in-place
  ~ resource "google_cloud_run_service" "cloudrun" {
        id                         = "locations/us-west3/namespaces/libops-public-microservices/services/hypercube"
        name                       = "hypercube"
        # (4 unchanged attributes hidden)

      ~ template {
          ~ spec {
                # (4 unchanged attributes hidden)

              ~ containers {
                  ~ image   = "lehighlts/scyllaridae-tesseract:main@sha256:f978ec9271bdf3c76739ae4084700a10fb092eb10765151bafae3fc8a1d5a2a3" -> "ghcr.io/lehigh-university-libraries/scyllaridae-tesseract:main"
                    name    = "hypercube"
                    # (2 unchanged attributes hidden)

                    # (5 unchanged blocks hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.hypercube.google_cloud_run_service.cloudrun["us-west4"] will be updated in-place
  ~ resource "google_cloud_run_service" "cloudrun" {
        id                         = "locations/us-west4/namespaces/libops-public-microservices/services/hypercube"
        name                       = "hypercube"
        # (4 unchanged attributes hidden)

      ~ template {
          ~ spec {
                # (4 unchanged attributes hidden)

              ~ containers {
                  ~ image   = "lehighlts/scyllaridae-tesseract:main@sha256:f978ec9271bdf3c76739ae4084700a10fb092eb10765151bafae3fc8a1d5a2a3" -> "ghcr.io/lehigh-university-libraries/scyllaridae-tesseract:main"
                    name    = "hypercube"
                    # (2 unchanged attributes hidden)

                    # (5 unchanged blocks hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.lb.google_compute_url_map.default will be updated in-place
  ~ resource "google_compute_url_map" "default" {
        id                 = "projects/libops-public-microservices/global/urlMaps/microservices-url-map"
        name               = "microservices-url-map"
        # (5 unchanged attributes hidden)

      ~ path_matcher {
            name            = "allpaths"
            # (1 unchanged attribute hidden)

          ~ path_rule {
              ~ paths   = [
                  - "/homarus",
                  - "/homarus/*",
                  + "/gpt",
                  + "/gpt/*",
                ]
              ~ service = "https://www.googleapis.com/compute/v1/projects/libops-public-microservices/global/backendServices/libops-backend-homarus" -> (known after apply)

                # (1 unchanged block hidden)
            }
          ~ path_rule {
              ~ paths   = [
                  - "/houdini",
                  - "/houdini/*",
                  + "/homarus",
                  + "/homarus/*",
                ]
              ~ service = "https://www.googleapis.com/compute/v1/projects/libops-public-microservices/global/backendServices/libops-backend-houdini" -> "projects/libops-public-microservices/global/backendServices/libops-backend-homarus"

                # (1 unchanged block hidden)
            }
          ~ path_rule {
              ~ paths   = [
                  - "/hypercube",
                  - "/hypercube/*",
                  + "/houdini",
                  + "/houdini/*",
                ]
              ~ service = "https://www.googleapis.com/compute/v1/projects/libops-public-microservices/global/backendServices/libops-backend-hypercube" -> "projects/libops-public-microservices/global/backendServices/libops-backend-houdini"

                # (1 unchanged block hidden)
            }
          ~ path_rule {
              ~ paths   = [
                  - "/libreoffice",
                  - "/libreoffice/*",
                  + "/hypercube",
                  + "/hypercube/*",
                ]
              ~ service = "https://www.googleapis.com/compute/v1/projects/libops-public-microservices/global/backendServices/libops-backend-libreoffice" -> "projects/libops-public-microservices/global/backendServices/libops-backend-hypercube"

                # (1 unchanged block hidden)
            }
          ~ path_rule {
              ~ paths   = [
                  - "/ocrpdf",
                  - "/ocrpdf/*",
                  + "/libreoffice",
                  + "/libreoffice/*",
                ]
              ~ service = "https://www.googleapis.com/compute/v1/projects/libops-public-microservices/global/backendServices/libops-backend-ocrpdf" -> "projects/libops-public-microservices/global/backendServices/libops-backend-libreoffice"

                # (1 unchanged block hidden)
            }
          ~ path_rule {
              ~ paths   = [
                  - "/pandoc",
                  - "/pandoc/*",
                  + "/ocrpdf",
                  + "/ocrpdf/*",
                ]
              ~ service = "https://www.googleapis.com/compute/v1/projects/libops-public-microservices/global/backendServices/libops-backend-pandoc" -> "projects/libops-public-microservices/global/backendServices/libops-backend-ocrpdf"

                # (1 unchanged block hidden)
            }
          ~ path_rule {
              ~ paths   = [
                  - "/whisper",
                  - "/whisper/*",
                  + "/pandoc",
                  + "/pandoc/*",
                ]
              ~ service = "https://www.googleapis.com/compute/v1/projects/libops-public-microservices/global/backendServices/libops-backend-whisper" -> "projects/libops-public-microservices/global/backendServices/libops-backend-pandoc"

                # (1 unchanged block hidden)
            }

            # (2 unchanged blocks hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.libreoffice.google_cloud_run_service.cloudrun["australia-southeast1"] will be updated in-place
  ~ resource "google_cloud_run_service" "cloudrun" {
        id                         = "locations/australia-southeast1/namespaces/libops-public-microservices/services/libreoffice"
        name                       = "libreoffice"
        # (4 unchanged attributes hidden)

      ~ template {
          ~ spec {
                # (4 unchanged attributes hidden)

              ~ containers {
                  ~ image   = "lehighlts/scyllaridae-libreoffice:main@sha256:a75cb3075dc0093bd6042bd0323c69c477ab02ee4b359460ec159279ae44671b" -> "ghcr.io/lehigh-university-libraries/scyllaridae-libreoffice:main"
                    name    = "libreoffice"
                    # (2 unchanged attributes hidden)

                    # (5 unchanged blocks hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.libreoffice.google_cloud_run_service.cloudrun["australia-southeast2"] will be updated in-place
  ~ resource "google_cloud_run_service" "cloudrun" {
        id                         = "locations/australia-southeast2/namespaces/libops-public-microservices/services/libreoffice"
        name                       = "libreoffice"
        # (4 unchanged attributes hidden)

      ~ template {
          ~ spec {
                # (4 unchanged attributes hidden)

              ~ containers {
                  ~ image   = "lehighlts/scyllaridae-libreoffice:main@sha256:a75cb3075dc0093bd6042bd0323c69c477ab02ee4b359460ec159279ae44671b" -> "ghcr.io/lehigh-university-libraries/scyllaridae-libreoffice:main"
                    name    = "libreoffice"
                    # (2 unchanged attributes hidden)

                    # (5 unchanged blocks hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.libreoffice.google_cloud_run_service.cloudrun["northamerica-northeast1"] will be updated in-place
  ~ resource "google_cloud_run_service" "cloudrun" {
        id                         = "locations/northamerica-northeast1/namespaces/libops-public-microservices/services/libreoffice"
        name                       = "libreoffice"
        # (4 unchanged attributes hidden)

      ~ template {
          ~ spec {
                # (4 unchanged attributes hidden)

              ~ containers {
                  ~ image   = "lehighlts/scyllaridae-libreoffice:main@sha256:a75cb3075dc0093bd6042bd0323c69c477ab02ee4b359460ec159279ae44671b" -> "ghcr.io/lehigh-university-libraries/scyllaridae-libreoffice:main"
                    name    = "libreoffice"
                    # (2 unchanged attributes hidden)

                    # (5 unchanged blocks hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.libreoffice.google_cloud_run_service.cloudrun["northamerica-northeast2"] will be updated in-place
  ~ resource "google_cloud_run_service" "cloudrun" {
        id                         = "locations/northamerica-northeast2/namespaces/libops-public-microservices/services/libreoffice"
        name                       = "libreoffice"
        # (4 unchanged attributes hidden)

      ~ template {
          ~ spec {
                # (4 unchanged attributes hidden)

              ~ containers {
                  ~ image   = "lehighlts/scyllaridae-libreoffice:main@sha256:a75cb3075dc0093bd6042bd0323c69c477ab02ee4b359460ec159279ae44671b" -> "ghcr.io/lehigh-university-libraries/scyllaridae-libreoffice:main"
                    name    = "libreoffice"
                    # (2 unchanged attributes hidden)

                    # (5 unchanged blocks hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.libreoffice.google_cloud_run_service.cloudrun["us-central1"] will be updated in-place
  ~ resource "google_cloud_run_service" "cloudrun" {
        id                         = "locations/us-central1/namespaces/libops-public-microservices/services/libreoffice"
        name                       = "libreoffice"
        # (4 unchanged attributes hidden)

      ~ template {
          ~ spec {
                # (4 unchanged attributes hidden)

              ~ containers {
                  ~ image   = "lehighlts/scyllaridae-libreoffice:main@sha256:a75cb3075dc0093bd6042bd0323c69c477ab02ee4b359460ec159279ae44671b" -> "ghcr.io/lehigh-university-libraries/scyllaridae-libreoffice:main"
                    name    = "libreoffice"
                    # (2 unchanged attributes hidden)

                    # (5 unchanged blocks hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.libreoffice.google_cloud_run_service.cloudrun["us-east4"] will be updated in-place
  ~ resource "google_cloud_run_service" "cloudrun" {
        id                         = "locations/us-east4/namespaces/libops-public-microservices/services/libreoffice"
        name                       = "libreoffice"
        # (4 unchanged attributes hidden)

      ~ template {
          ~ spec {
                # (4 unchanged attributes hidden)

              ~ containers {
                  ~ image   = "lehighlts/scyllaridae-libreoffice:main@sha256:a75cb3075dc0093bd6042bd0323c69c477ab02ee4b359460ec159279ae44671b" -> "ghcr.io/lehigh-university-libraries/scyllaridae-libreoffice:main"
                    name    = "libreoffice"
                    # (2 unchanged attributes hidden)

                    # (5 unchanged blocks hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.libreoffice.google_cloud_run_service.cloudrun["us-east5"] will be updated in-place
  ~ resource "google_cloud_run_service" "cloudrun" {
        id                         = "locations/us-east5/namespaces/libops-public-microservices/services/libreoffice"
        name                       = "libreoffice"
        # (4 unchanged attributes hidden)

      ~ template {
          ~ spec {
                # (4 unchanged attributes hidden)

              ~ containers {
                  ~ image   = "lehighlts/scyllaridae-libreoffice:main@sha256:a75cb3075dc0093bd6042bd0323c69c477ab02ee4b359460ec159279ae44671b" -> "ghcr.io/lehigh-university-libraries/scyllaridae-libreoffice:main"
                    name    = "libreoffice"
                    # (2 unchanged attributes hidden)

                    # (5 unchanged blocks hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.libreoffice.google_cloud_run_service.cloudrun["us-south1"] will be updated in-place
  ~ resource "google_cloud_run_service" "cloudrun" {
        id                         = "locations/us-south1/namespaces/libops-public-microservices/services/libreoffice"
        name                       = "libreoffice"
        # (4 unchanged attributes hidden)

      ~ template {
          ~ spec {
                # (4 unchanged attributes hidden)

              ~ containers {
                  ~ image   = "lehighlts/scyllaridae-libreoffice:main@sha256:a75cb3075dc0093bd6042bd0323c69c477ab02ee4b359460ec159279ae44671b" -> "ghcr.io/lehigh-university-libraries/scyllaridae-libreoffice:main"
                    name    = "libreoffice"
                    # (2 unchanged attributes hidden)

                    # (5 unchanged blocks hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.libreoffice.google_cloud_run_service.cloudrun["us-west1"] will be updated in-place
  ~ resource "google_cloud_run_service" "cloudrun" {
        id                         = "locations/us-west1/namespaces/libops-public-microservices/services/libreoffice"
        name                       = "libreoffice"
        # (4 unchanged attributes hidden)

      ~ template {
          ~ spec {
                # (4 unchanged attributes hidden)

              ~ containers {
                  ~ image   = "lehighlts/scyllaridae-libreoffice:main@sha256:a75cb3075dc0093bd6042bd0323c69c477ab02ee4b359460ec159279ae44671b" -> "ghcr.io/lehigh-university-libraries/scyllaridae-libreoffice:main"
                    name    = "libreoffice"
                    # (2 unchanged attributes hidden)

                    # (5 unchanged blocks hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.libreoffice.google_cloud_run_service.cloudrun["us-west3"] will be updated in-place
  ~ resource "google_cloud_run_service" "cloudrun" {
        id                         = "locations/us-west3/namespaces/libops-public-microservices/services/libreoffice"
        name                       = "libreoffice"
        # (4 unchanged attributes hidden)

      ~ template {
          ~ spec {
                # (4 unchanged attributes hidden)

              ~ containers {
                  ~ image   = "lehighlts/scyllaridae-libreoffice:main@sha256:a75cb3075dc0093bd6042bd0323c69c477ab02ee4b359460ec159279ae44671b" -> "ghcr.io/lehigh-university-libraries/scyllaridae-libreoffice:main"
                    name    = "libreoffice"
                    # (2 unchanged attributes hidden)

                    # (5 unchanged blocks hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.libreoffice.google_cloud_run_service.cloudrun["us-west4"] will be updated in-place
  ~ resource "google_cloud_run_service" "cloudrun" {
        id                         = "locations/us-west4/namespaces/libops-public-microservices/services/libreoffice"
        name                       = "libreoffice"
        # (4 unchanged attributes hidden)

      ~ template {
          ~ spec {
                # (4 unchanged attributes hidden)

              ~ containers {
                  ~ image   = "lehighlts/scyllaridae-libreoffice:main@sha256:a75cb3075dc0093bd6042bd0323c69c477ab02ee4b359460ec159279ae44671b" -> "ghcr.io/lehigh-university-libraries/scyllaridae-libreoffice:main"
                    name    = "libreoffice"
                    # (2 unchanged attributes hidden)

                    # (5 unchanged blocks hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.ocrpdf.google_cloud_run_service.cloudrun["australia-southeast1"] will be updated in-place
  ~ resource "google_cloud_run_service" "cloudrun" {
        id                         = "locations/australia-southeast1/namespaces/libops-public-microservices/services/ocrpdf"
        name                       = "ocrpdf"
        # (4 unchanged attributes hidden)

      ~ template {
          ~ spec {
                # (4 unchanged attributes hidden)

              ~ containers {
                  ~ image   = "lehighlts/scyllaridae-ocrpdf:main@sha256:399e74b07e281dd271b75a7362203641ac651a94daaf1dc7c9dc67ab7f09b05a" -> "ghcr.io/lehigh-university-libraries/scyllaridae-ocrpdf:main"
                    name    = "ocrpdf"
                    # (2 unchanged attributes hidden)

                    # (5 unchanged blocks hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.ocrpdf.google_cloud_run_service.cloudrun["australia-southeast2"] will be updated in-place
  ~ resource "google_cloud_run_service" "cloudrun" {
        id                         = "locations/australia-southeast2/namespaces/libops-public-microservices/services/ocrpdf"
        name                       = "ocrpdf"
        # (4 unchanged attributes hidden)

      ~ template {
          ~ spec {
                # (4 unchanged attributes hidden)

              ~ containers {
                  ~ image   = "lehighlts/scyllaridae-ocrpdf:main@sha256:399e74b07e281dd271b75a7362203641ac651a94daaf1dc7c9dc67ab7f09b05a" -> "ghcr.io/lehigh-university-libraries/scyllaridae-ocrpdf:main"
                    name    = "ocrpdf"
                    # (2 unchanged attributes hidden)

                    # (5 unchanged blocks hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.ocrpdf.google_cloud_run_service.cloudrun["northamerica-northeast1"] will be updated in-place
  ~ resource "google_cloud_run_service" "cloudrun" {
        id                         = "locations/northamerica-northeast1/namespaces/libops-public-microservices/services/ocrpdf"
        name                       = "ocrpdf"
        # (4 unchanged attributes hidden)

      ~ template {
          ~ spec {
                # (4 unchanged attributes hidden)

              ~ containers {
                  ~ image   = "lehighlts/scyllaridae-ocrpdf:main@sha256:399e74b07e281dd271b75a7362203641ac651a94daaf1dc7c9dc67ab7f09b05a" -> "ghcr.io/lehigh-university-libraries/scyllaridae-ocrpdf:main"
                    name    = "ocrpdf"
                    # (2 unchanged attributes hidden)

                    # (5 unchanged blocks hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.ocrpdf.google_cloud_run_service.cloudrun["northamerica-northeast2"] will be updated in-place
  ~ resource "google_cloud_run_service" "cloudrun" {
        id                         = "locations/northamerica-northeast2/namespaces/libops-public-microservices/services/ocrpdf"
        name                       = "ocrpdf"
        # (4 unchanged attributes hidden)

      ~ template {
          ~ spec {
                # (4 unchanged attributes hidden)

              ~ containers {
                  ~ image   = "lehighlts/scyllaridae-ocrpdf:main@sha256:399e74b07e281dd271b75a7362203641ac651a94daaf1dc7c9dc67ab7f09b05a" -> "ghcr.io/lehigh-university-libraries/scyllaridae-ocrpdf:main"
                    name    = "ocrpdf"
                    # (2 unchanged attributes hidden)

                    # (5 unchanged blocks hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.ocrpdf.google_cloud_run_service.cloudrun["us-central1"] will be updated in-place
  ~ resource "google_cloud_run_service" "cloudrun" {
        id                         = "locations/us-central1/namespaces/libops-public-microservices/services/ocrpdf"
        name                       = "ocrpdf"
        # (4 unchanged attributes hidden)

      ~ template {
          ~ spec {
                # (4 unchanged attributes hidden)

              ~ containers {
                  ~ image   = "lehighlts/scyllaridae-ocrpdf:main@sha256:399e74b07e281dd271b75a7362203641ac651a94daaf1dc7c9dc67ab7f09b05a" -> "ghcr.io/lehigh-university-libraries/scyllaridae-ocrpdf:main"
                    name    = "ocrpdf"
                    # (2 unchanged attributes hidden)

                    # (5 unchanged blocks hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.ocrpdf.google_cloud_run_service.cloudrun["us-east4"] will be updated in-place
  ~ resource "google_cloud_run_service" "cloudrun" {
        id                         = "locations/us-east4/namespaces/libops-public-microservices/services/ocrpdf"
        name                       = "ocrpdf"
        # (4 unchanged attributes hidden)

      ~ template {
          ~ spec {
                # (4 unchanged attributes hidden)

              ~ containers {
                  ~ image   = "lehighlts/scyllaridae-ocrpdf:main@sha256:399e74b07e281dd271b75a7362203641ac651a94daaf1dc7c9dc67ab7f09b05a" -> "ghcr.io/lehigh-university-libraries/scyllaridae-ocrpdf:main"
                    name    = "ocrpdf"
                    # (2 unchanged attributes hidden)

                    # (5 unchanged blocks hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.ocrpdf.google_cloud_run_service.cloudrun["us-east5"] will be updated in-place
  ~ resource "google_cloud_run_service" "cloudrun" {
        id                         = "locations/us-east5/namespaces/libops-public-microservices/services/ocrpdf"
        name                       = "ocrpdf"
        # (4 unchanged attributes hidden)

      ~ template {
          ~ spec {
                # (4 unchanged attributes hidden)

              ~ containers {
                  ~ image   = "lehighlts/scyllaridae-ocrpdf:main@sha256:399e74b07e281dd271b75a7362203641ac651a94daaf1dc7c9dc67ab7f09b05a" -> "ghcr.io/lehigh-university-libraries/scyllaridae-ocrpdf:main"
                    name    = "ocrpdf"
                    # (2 unchanged attributes hidden)

                    # (5 unchanged blocks hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.ocrpdf.google_cloud_run_service.cloudrun["us-south1"] will be updated in-place
  ~ resource "google_cloud_run_service" "cloudrun" {
        id                         = "locations/us-south1/namespaces/libops-public-microservices/services/ocrpdf"
        name                       = "ocrpdf"
        # (4 unchanged attributes hidden)

      ~ template {
          ~ spec {
                # (4 unchanged attributes hidden)

              ~ containers {
                  ~ image   = "lehighlts/scyllaridae-ocrpdf:main@sha256:399e74b07e281dd271b75a7362203641ac651a94daaf1dc7c9dc67ab7f09b05a" -> "ghcr.io/lehigh-university-libraries/scyllaridae-ocrpdf:main"
                    name    = "ocrpdf"
                    # (2 unchanged attributes hidden)

                    # (5 unchanged blocks hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.ocrpdf.google_cloud_run_service.cloudrun["us-west1"] will be updated in-place
  ~ resource "google_cloud_run_service" "cloudrun" {
        id                         = "locations/us-west1/namespaces/libops-public-microservices/services/ocrpdf"
        name                       = "ocrpdf"
        # (4 unchanged attributes hidden)

      ~ template {
          ~ spec {
                # (4 unchanged attributes hidden)

              ~ containers {
                  ~ image   = "lehighlts/scyllaridae-ocrpdf:main@sha256:399e74b07e281dd271b75a7362203641ac651a94daaf1dc7c9dc67ab7f09b05a" -> "ghcr.io/lehigh-university-libraries/scyllaridae-ocrpdf:main"
                    name    = "ocrpdf"
                    # (2 unchanged attributes hidden)

                    # (5 unchanged blocks hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.ocrpdf.google_cloud_run_service.cloudrun["us-west3"] will be updated in-place
  ~ resource "google_cloud_run_service" "cloudrun" {
        id                         = "locations/us-west3/namespaces/libops-public-microservices/services/ocrpdf"
        name                       = "ocrpdf"
        # (4 unchanged attributes hidden)

      ~ template {
          ~ spec {
                # (4 unchanged attributes hidden)

              ~ containers {
                  ~ image   = "lehighlts/scyllaridae-ocrpdf:main@sha256:399e74b07e281dd271b75a7362203641ac651a94daaf1dc7c9dc67ab7f09b05a" -> "ghcr.io/lehigh-university-libraries/scyllaridae-ocrpdf:main"
                    name    = "ocrpdf"
                    # (2 unchanged attributes hidden)

                    # (5 unchanged blocks hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.ocrpdf.google_cloud_run_service.cloudrun["us-west4"] will be updated in-place
  ~ resource "google_cloud_run_service" "cloudrun" {
        id                         = "locations/us-west4/namespaces/libops-public-microservices/services/ocrpdf"
        name                       = "ocrpdf"
        # (4 unchanged attributes hidden)

      ~ template {
          ~ spec {
                # (4 unchanged attributes hidden)

              ~ containers {
                  ~ image   = "lehighlts/scyllaridae-ocrpdf:main@sha256:399e74b07e281dd271b75a7362203641ac651a94daaf1dc7c9dc67ab7f09b05a" -> "ghcr.io/lehigh-university-libraries/scyllaridae-ocrpdf:main"
                    name    = "ocrpdf"
                    # (2 unchanged attributes hidden)

                    # (5 unchanged blocks hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.pandoc.google_cloud_run_service.cloudrun["australia-southeast1"] will be updated in-place
  ~ resource "google_cloud_run_service" "cloudrun" {
        id                         = "locations/australia-southeast1/namespaces/libops-public-microservices/services/pandoc"
        name                       = "pandoc"
        # (4 unchanged attributes hidden)

      ~ template {
          ~ spec {
                # (4 unchanged attributes hidden)

              ~ containers {
                  ~ image   = "lehighlts/scyllaridae-pandoc:main@sha256:cdf44bca03ebdc175730166162d5fb70c9063ebf3658a1ce79bf9facfb25ae6a" -> "ghcr.io/lehigh-university-libraries/scyllaridae-pandoc:main"
                    name    = "pandoc"
                    # (2 unchanged attributes hidden)

                    # (5 unchanged blocks hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.pandoc.google_cloud_run_service.cloudrun["australia-southeast2"] will be updated in-place
  ~ resource "google_cloud_run_service" "cloudrun" {
        id                         = "locations/australia-southeast2/namespaces/libops-public-microservices/services/pandoc"
        name                       = "pandoc"
        # (4 unchanged attributes hidden)

      ~ template {
          ~ spec {
                # (4 unchanged attributes hidden)

              ~ containers {
                  ~ image   = "lehighlts/scyllaridae-pandoc:main@sha256:cdf44bca03ebdc175730166162d5fb70c9063ebf3658a1ce79bf9facfb25ae6a" -> "ghcr.io/lehigh-university-libraries/scyllaridae-pandoc:main"
                    name    = "pandoc"
                    # (2 unchanged attributes hidden)

                    # (5 unchanged blocks hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.pandoc.google_cloud_run_service.cloudrun["northamerica-northeast1"] will be updated in-place
  ~ resource "google_cloud_run_service" "cloudrun" {
        id                         = "locations/northamerica-northeast1/namespaces/libops-public-microservices/services/pandoc"
        name                       = "pandoc"
        # (4 unchanged attributes hidden)

      ~ template {
          ~ spec {
                # (4 unchanged attributes hidden)

              ~ containers {
                  ~ image   = "lehighlts/scyllaridae-pandoc:main@sha256:cdf44bca03ebdc175730166162d5fb70c9063ebf3658a1ce79bf9facfb25ae6a" -> "ghcr.io/lehigh-university-libraries/scyllaridae-pandoc:main"
                    name    = "pandoc"
                    # (2 unchanged attributes hidden)

                    # (5 unchanged blocks hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.pandoc.google_cloud_run_service.cloudrun["northamerica-northeast2"] will be updated in-place
  ~ resource "google_cloud_run_service" "cloudrun" {
        id                         = "locations/northamerica-northeast2/namespaces/libops-public-microservices/services/pandoc"
        name                       = "pandoc"
        # (4 unchanged attributes hidden)

      ~ template {
          ~ spec {
                # (4 unchanged attributes hidden)

              ~ containers {
                  ~ image   = "lehighlts/scyllaridae-pandoc:main@sha256:cdf44bca03ebdc175730166162d5fb70c9063ebf3658a1ce79bf9facfb25ae6a" -> "ghcr.io/lehigh-university-libraries/scyllaridae-pandoc:main"
                    name    = "pandoc"
                    # (2 unchanged attributes hidden)

                    # (5 unchanged blocks hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.pandoc.google_cloud_run_service.cloudrun["us-central1"] will be updated in-place
  ~ resource "google_cloud_run_service" "cloudrun" {
        id                         = "locations/us-central1/namespaces/libops-public-microservices/services/pandoc"
        name                       = "pandoc"
        # (4 unchanged attributes hidden)

      ~ template {
          ~ spec {
                # (4 unchanged attributes hidden)

              ~ containers {
                  ~ image   = "lehighlts/scyllaridae-pandoc:main@sha256:cdf44bca03ebdc175730166162d5fb70c9063ebf3658a1ce79bf9facfb25ae6a" -> "ghcr.io/lehigh-university-libraries/scyllaridae-pandoc:main"
                    name    = "pandoc"
                    # (2 unchanged attributes hidden)

                    # (5 unchanged blocks hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.pandoc.google_cloud_run_service.cloudrun["us-east4"] will be updated in-place
  ~ resource "google_cloud_run_service" "cloudrun" {
        id                         = "locations/us-east4/namespaces/libops-public-microservices/services/pandoc"
        name                       = "pandoc"
        # (4 unchanged attributes hidden)

      ~ template {
          ~ spec {
                # (4 unchanged attributes hidden)

              ~ containers {
                  ~ image   = "lehighlts/scyllaridae-pandoc:main@sha256:cdf44bca03ebdc175730166162d5fb70c9063ebf3658a1ce79bf9facfb25ae6a" -> "ghcr.io/lehigh-university-libraries/scyllaridae-pandoc:main"
                    name    = "pandoc"
                    # (2 unchanged attributes hidden)

                    # (5 unchanged blocks hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.pandoc.google_cloud_run_service.cloudrun["us-east5"] will be updated in-place
  ~ resource "google_cloud_run_service" "cloudrun" {
        id                         = "locations/us-east5/namespaces/libops-public-microservices/services/pandoc"
        name                       = "pandoc"
        # (4 unchanged attributes hidden)

      ~ template {
          ~ spec {
                # (4 unchanged attributes hidden)

              ~ containers {
                  ~ image   = "lehighlts/scyllaridae-pandoc:main@sha256:cdf44bca03ebdc175730166162d5fb70c9063ebf3658a1ce79bf9facfb25ae6a" -> "ghcr.io/lehigh-university-libraries/scyllaridae-pandoc:main"
                    name    = "pandoc"
                    # (2 unchanged attributes hidden)

                    # (5 unchanged blocks hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.pandoc.google_cloud_run_service.cloudrun["us-south1"] will be updated in-place
  ~ resource "google_cloud_run_service" "cloudrun" {
        id                         = "locations/us-south1/namespaces/libops-public-microservices/services/pandoc"
        name                       = "pandoc"
        # (4 unchanged attributes hidden)

      ~ template {
          ~ spec {
                # (4 unchanged attributes hidden)

              ~ containers {
                  ~ image   = "lehighlts/scyllaridae-pandoc:main@sha256:cdf44bca03ebdc175730166162d5fb70c9063ebf3658a1ce79bf9facfb25ae6a" -> "ghcr.io/lehigh-university-libraries/scyllaridae-pandoc:main"
                    name    = "pandoc"
                    # (2 unchanged attributes hidden)

                    # (5 unchanged blocks hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.pandoc.google_cloud_run_service.cloudrun["us-west1"] will be updated in-place
  ~ resource "google_cloud_run_service" "cloudrun" {
        id                         = "locations/us-west1/namespaces/libops-public-microservices/services/pandoc"
        name                       = "pandoc"
        # (4 unchanged attributes hidden)

      ~ template {
          ~ spec {
                # (4 unchanged attributes hidden)

              ~ containers {
                  ~ image   = "lehighlts/scyllaridae-pandoc:main@sha256:cdf44bca03ebdc175730166162d5fb70c9063ebf3658a1ce79bf9facfb25ae6a" -> "ghcr.io/lehigh-university-libraries/scyllaridae-pandoc:main"
                    name    = "pandoc"
                    # (2 unchanged attributes hidden)

                    # (5 unchanged blocks hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.pandoc.google_cloud_run_service.cloudrun["us-west3"] will be updated in-place
  ~ resource "google_cloud_run_service" "cloudrun" {
        id                         = "locations/us-west3/namespaces/libops-public-microservices/services/pandoc"
        name                       = "pandoc"
        # (4 unchanged attributes hidden)

      ~ template {
          ~ spec {
                # (4 unchanged attributes hidden)

              ~ containers {
                  ~ image   = "lehighlts/scyllaridae-pandoc:main@sha256:cdf44bca03ebdc175730166162d5fb70c9063ebf3658a1ce79bf9facfb25ae6a" -> "ghcr.io/lehigh-university-libraries/scyllaridae-pandoc:main"
                    name    = "pandoc"
                    # (2 unchanged attributes hidden)

                    # (5 unchanged blocks hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.pandoc.google_cloud_run_service.cloudrun["us-west4"] will be updated in-place
  ~ resource "google_cloud_run_service" "cloudrun" {
        id                         = "locations/us-west4/namespaces/libops-public-microservices/services/pandoc"
        name                       = "pandoc"
        # (4 unchanged attributes hidden)

      ~ template {
          ~ spec {
                # (4 unchanged attributes hidden)

              ~ containers {
                  ~ image   = "lehighlts/scyllaridae-pandoc:main@sha256:cdf44bca03ebdc175730166162d5fb70c9063ebf3658a1ce79bf9facfb25ae6a" -> "ghcr.io/lehigh-university-libraries/scyllaridae-pandoc:main"
                    name    = "pandoc"
                    # (2 unchanged attributes hidden)

                    # (5 unchanged blocks hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.whisper.google_cloud_run_v2_service.cloudrun["us-central1"] will be destroyed
  # (because google_cloud_run_v2_service.cloudrun is not in configuration)
  - resource "google_cloud_run_v2_service" "cloudrun" {
      - annotations             = {} -> null
      - conditions              = [
          - {
              - execution_reason     = ""
              - last_transition_time = "2025-07-05T11:43:07.208991Z"
              - message              = ""
              - reason               = ""
              - revision_reason      = ""
              - severity             = ""
              - state                = "CONDITION_SUCCEEDED"
              - type                 = "RoutesReady"
            },
          - {
              - execution_reason     = ""
              - last_transition_time = "2025-07-05T11:43:05.967497Z"
              - message              = ""
              - reason               = ""
              - revision_reason      = ""
              - severity             = ""
              - state                = "CONDITION_SUCCEEDED"
              - type                 = "ConfigurationsReady"
            },
        ] -> null
      - create_time             = "2025-07-05T11:39:58.818692Z" -> null
      - creator                 = "libops-terraform@libops-terraform.iam.gserviceaccount.com" -> null
      - custom_audiences        = [] -> null
      - deletion_protection     = true -> null
      - effective_annotations   = {} -> null
      - effective_labels        = {
          - "goog-terraform-provisioned" = "true"
        } -> null
      - etag                    = ""CMCfpMMGEOD3vPEB/cHJvamVjdHMvbGlib3BzLXB1YmxpYy1taWNyb3NlcnZpY2VzL2xvY2F0aW9ucy91cy1jZW50cmFsMS9zZXJ2aWNlcy93aGlzcGVy"" -> null
      - generation              = "2" -> null
      - id                      = "projects/libops-public-microservices/locations/us-central1/services/whisper" -> null
      - ingress                 = "INGRESS_TRAFFIC_ALL" -> null
      - invoker_iam_disabled    = false -> null
      - labels                  = {} -> null
      - last_modifier           = "github@libops-public-microservices.iam.gserviceaccount.com" -> null
      - latest_created_revision = "projects/libops-public-microservices/locations/us-central1/services/whisper/revisions/whisper-00002-k86" -> null
      - latest_ready_revision   = "projects/libops-public-microservices/locations/us-central1/services/whisper/revisions/whisper-00002-k86" -> null
      - launch_stage            = "GA" -> null
      - location                = "us-central1" -> null
      - name                    = "whisper" -> null
      - observed_generation     = "2" -> null
      - project                 = "libops-public-microservices" -> null
      - reconciling             = false -> null
      - terminal_condition      = [
          - {
              - execution_reason     = ""
              - last_transition_time = "2025-07-05T11:43:07.252888Z"
              - message              = ""
              - reason               = ""
              - revision_reason      = ""
              - severity             = ""
              - state                = "CONDITION_SUCCEEDED"
              - type                 = "Ready"
            },
        ] -> null
      - terraform_labels        = {
          - "goog-terraform-provisioned" = "true"
        } -> null
      - traffic_statuses        = [
          - {
              - percent  = 100
              - revision = ""
              - tag      = ""
              - type     = "TRAFFIC_TARGET_ALLOCATION_TYPE_LATEST"
              - uri      = ""
            },
        ] -> null
      - uid                     = "5963fa51-8b5a-4bef-83b2-0ea84432119c" -> null
      - update_time             = "2025-07-05T11:42:56.506412Z" -> null
      - uri                     = "https://whisper-byfdfb32sq-uc.a.run.app" -> null
      - urls                    = [
          - "https://whisper-109032690895.us-central1.run.app",
          - "https://whisper-byfdfb32sq-uc.a.run.app",
        ] -> null

      - template {
          - annotations                      = {} -> null
          - execution_environment            = "EXECUTION_ENVIRONMENT_GEN2" -> null
          - gpu_zonal_redundancy_disabled    = true -> null
          - labels                           = {} -> null
          - max_instance_request_concurrency = 80 -> null
          - service_account                  = "cr-microservices@libops-public-microservices.iam.gserviceaccount.com" -> null
          - session_affinity                 = false -> null
          - timeout                          = "300s" -> null

          - containers {
              - args       = [] -> null
              - build_info = [] -> null
              - command    = [] -> null
              - depends_on = [] -> null
              - image      = "lehighlts/scyllaridae-whisper:main@sha256:65deefd5a092e62e4e5ce41372a883f26f2f558d7192d1b221347110cd77df32" -> null
              - name       = "whisper" -> null

              - env {
                  - name  = "SKIP_JWT_VERIFY" -> null
                  - value = "true" -> null
                }

              - liveness_probe {
                  - failure_threshold     = 1 -> null
                  - initial_delay_seconds = 0 -> null
                  - period_seconds        = 300 -> null
                  - timeout_seconds       = 1 -> null

                  - http_get {
                      - path = "/healthcheck" -> null
                      - port = 8080 -> null
                    }
                }

              - ports {
                  - container_port = 8080 -> null
                  - name           = "http1" -> null
                }

              - resources {
                  - cpu_idle          = false -> null
                  - limits            = {
                      - "cpu"            = "4000m"
                      - "memory"         = "16Gi"
                      - "nvidia.com/gpu" = "1"
                    } -> null
                  - startup_cpu_boost = false -> null
                }

              - startup_probe {
                  - failure_threshold     = 1 -> null
                  - initial_delay_seconds = 0 -> null
                  - period_seconds        = 240 -> null
                  - timeout_seconds       = 240 -> null

                  - tcp_socket {
                      - port = 8080 -> null
                    }
                }
            }

          - node_selector {
              - accelerator = "nvidia-l4" -> null
            }

          - scaling {
              - max_instance_count = 3 -> null
              - min_instance_count = 0 -> null
            }
        }

      - traffic {
          - percent = 100 -> null
          - type    = "TRAFFIC_TARGET_ALLOCATION_TYPE_LATEST" -> null
        }
    }

  # module.whisper.google_compute_backend_service.backend[0] will be destroyed
  # (because google_compute_backend_service.backend is not in configuration)
  - resource "google_compute_backend_service" "backend" {
      - affinity_cookie_ttl_sec                       = 0 -> null
      - connection_draining_timeout_sec               = 300 -> null
      - creation_timestamp                            = "2024-11-16T13:12:41.495-08:00" -> null
      - custom_request_headers                        = [] -> null
      - custom_response_headers                       = [] -> null
      - enable_cdn                                    = false -> null
      - external_managed_migration_testing_percentage = 0 -> null
      - fingerprint                                   = "3toE0UaJRGg=" -> null
      - generated_id                                  = 7615831485485200000 -> null
      - health_checks                                 = [] -> null
      - id                                            = "projects/libops-public-microservices/global/backendServices/libops-backend-whisper" -> null
      - load_balancing_scheme                         = "EXTERNAL_MANAGED" -> null
      - name                                          = "libops-backend-whisper" -> null
      - port_name                                     = "http" -> null
      - project                                       = "libops-public-microservices" -> null
      - protocol                                      = "HTTPS" -> null
      - self_link                                     = "https://www.googleapis.com/compute/v1/projects/libops-public-microservices/global/backendServices/libops-backend-whisper" -> null
      - session_affinity                              = "NONE" -> null
      - timeout_sec                                   = 30 -> null

      - backend {
          - balancing_mode               = "UTILIZATION" -> null
          - capacity_scaler              = 1 -> null
          - group                        = "https://www.googleapis.com/compute/v1/projects/libops-public-microservices/regions/us-central1/networkEndpointGroups/libops-neg-whisper-us-central1" -> null
          - max_connections              = 0 -> null
          - max_connections_per_endpoint = 0 -> null
          - max_connections_per_instance = 0 -> null
          - max_rate                     = 0 -> null
          - max_rate_per_endpoint        = 0 -> null
          - max_rate_per_instance        = 0 -> null
          - max_utilization              = 0 -> null
        }

      - iap {
          - enabled                     = false -> null
          - oauth2_client_secret_sha256 = (sensitive value) -> null
        }

      - log_config {
          - enable          = true -> null
          - optional_fields = [] -> null
          - optional_mode   = "EXCLUDE_ALL_OPTIONAL" -> null
          - sample_rate     = 1 -> null
        }
    }

  # module.whisper.google_compute_region_network_endpoint_group.neg["us-central1"] will be destroyed
  # (because google_compute_region_network_endpoint_group.neg is not in configuration)
  - resource "google_compute_region_network_endpoint_group" "neg" {
      - id                    = "projects/libops-public-microservices/regions/us-central1/networkEndpointGroups/libops-neg-whisper-us-central1" -> null
      - name                  = "libops-neg-whisper-us-central1" -> null
      - network_endpoint_type = "SERVERLESS" -> null
      - project               = "libops-public-microservices" -> null
      - region                = "https://www.googleapis.com/compute/v1/projects/libops-public-microservices/regions/us-central1" -> null
      - self_link             = "https://www.googleapis.com/compute/v1/projects/libops-public-microservices/regions/us-central1/networkEndpointGroups/libops-neg-whisper-us-central1" -> null

      - cloud_run {
          - service = "whisper" -> null
        }
    }

Plan: 4 to add, 89 to change, 3 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>